_protected/common/models/UserIdentity.php

SELECT * FROM `user` WHERE `auth_key`='fPTKbSXFFPt-Q7d1KPN4KMytAWbu4cGQ'
---
	public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['auth_key' => $token]);