_protected/common/models/User.php

SELECT * FROM `user` WHERE (`username`='admin') AND (`status`=10)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => User::STATUS_ACTIVE]);